In [1]:
import pandas as pd

* Window Functions are used to perform calculations across a range of rows, not just one row.

* They are used when you want to analyze trends, moving averages, running totals, rolling statistics, etc.
 
 ### sometimes you don’t want:

Just one value (like mean or sum)

You want values calculated over a sliding window.

Example:

Average age of last 5 passengers

Sum of last 10 fares

Running average of fares (expanding)

Exponential Moving Average (trading)

In [2]:
df=pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

>## Rolling Window 
Rolling = last N rows

In [10]:
# average age of last 5 passengers
df['age_5_rolling']=df['Age'].rolling(5).mean()
df[['Age','age_5_rolling']].head(11)

     Age  age_5_rolling
0   22.0            NaN
1   38.0            NaN
2   26.0            NaN
3   35.0            NaN
4   35.0           31.2
5    NaN            NaN
6   54.0            NaN
7    2.0            NaN
8   27.0            NaN
9   14.0            NaN
10   4.0           20.2

For row 5 → average of rows 1–5

For row 6 → average of rows 2–6

For row 7 → average of rows 3–7

It slides like a window → therefore rolling window.

In [12]:
# Rolling Sum (Fare of last 5 passengers)
df['rolling_fare_5']=df['Fare'].rolling(5).sum()
df[['Fare','rolling_fare_5']].head(11)

       Fare  rolling_fare_5
0    7.2500             NaN
1   71.2833             NaN
2    7.9250             NaN
3   53.1000             NaN
4    8.0500        147.6083
5    8.4583        148.8166
6   51.8625        129.3958
7   21.0750        142.5458
8   11.1333        100.5791
9   30.0708        122.5999
10  16.7000        130.8416

**Through rolling we can do max,min,mode etc**

<br><br>

>## EXPANDING WINDOW

* Expanding window = starts from the first row and grows.

In [13]:
df['Fare_expanding_mean'] = df['Fare'].expanding().mean()
df[['Fare', 'Fare_expanding_mean']].head(10)

      Fare  Fare_expanding_mean
0   7.2500             7.250000
1  71.2833            39.266650
2   7.9250            28.819433
3  53.1000            34.889575
4   8.0500            29.521660
5   8.4583            26.011100
6  51.8625            29.704157
7  21.0750            28.625512
8  11.1333            26.681933
9  30.0708            27.020820

Row 1 → mean of row 1

Row 2 → mean of rows 1–2

Row 3 → mean of rows 1–3

Row N → mean of rows 1–N

Window keeps growing → never slides.

In [14]:
df['Fare_expanding_sum'] = df['Fare'].expanding().sum()
df[['Fare', 'Fare_expanding_sum']].head(10)

      Fare  Fare_expanding_sum
0   7.2500              7.2500
1  71.2833             78.5333
2   7.9250             86.4583
3  53.1000            139.5583
4   8.0500            147.6083
5   8.4583            156.0666
6  51.8625            207.9291
7  21.0750            229.0041
8  11.1333            240.1374
9  30.0708            270.2082

<br><br>

>## EXPONENTIAL WEIGHTED WINDOW (EWM / EMA)

Used in:

* Stock trading

* Trend analysis

* Smoothing noisy data

EMA = gives more weight to recent rows.

In [15]:
df['Fare_ema_10'] = df['Fare'].ewm(span=10, adjust=False).mean()
df[['Fare', 'Fare_ema_10']].head(10)

      Fare  Fare_ema_10
0   7.2500     7.250000
1  71.2833    18.892418
2   7.9250    16.898342
3  53.1000    23.480462
4   8.0500    20.674923
5   8.4583    18.453719
6  51.8625    24.528043
7  21.0750    23.900217
8  11.1333    21.578959
9  30.0708    23.122930

Meaning:

* Recent fares = more important

* Older fares = less important

 Important parameters:

span=10 → window size

adjust=False → recommended for trading

### formula is 
>EMA_today = (α × CurrentValue) + (1 − α) × EMA_yesterday

<br><br>

**Simple moving average (rolling):**

Gives equal weight to all values.

**EWM (EMA):**

Gives more weight to recent data
and less weight to old data.

 Why use EWM? (Simple)

* Because it reacts quickly:

* If fares suddenly jump to 200:

* Rolling mean slowly goes up

* EMA jumps fast, because recent values matter more

This is why EMA is used in:
✔ Stock market
✔ Trend detection
✔ Smoothing data
✔ Time-series analysis